Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов1/ВКМ_МассовоеСозданиеАктов1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов1</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорИРеализация</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом21_августа_новый/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>InformationRegister.ВКМ_МасовоеСозданиеДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов1/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьРеализацииДоговор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) ТОгда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период не заполнен!");
		Возврат;
	КонецЕсли;	

ПараметрыВыполнения = Новый Структура;
ЛогЗагрузки = "";

ПараметрыЗапуска = Новый Структура("ПараметрыВыполнения", ПараметрыВыполнения);

СтруктураФоновогоЗадания = СоздатьРеализацииНаСервере("ПараметрыЗапуска", УникальныйИдентификатор);
ИДЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
ИдентификаторЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;

ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
ПараметрыОжидания.Интервал = 1;

ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый 
ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект, ЛогЗагрузки), ПараметрыОжидания);

 КонецПроцедуры 


&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	 ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов();
	 
	 Если ДоговорыКонтрагентов.Количество() > 0 Тогда
		 Для Каждого Договор Из ДоговорыКонтрагентов Цикл
			 НоваяСтрока = Объект.ДоговорИРеализация.Добавить();
			 НоваяСтрока.Договор = Договор;
		 КонецЦикла;
	КонецЕсли;	 
	 
 КонецПроцедуры

 Функция ПолучитьДоговорыКонтрагентов() 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		 |ИЗ
		 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		 |ГДЕ
		 |	НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 МассивДоговоров = Новый Массив;
	 
	 Пока Выборка.Следующий() Цикл
		 МассивДоговоров.Добавить(Выборка.Ссылка);
	 КонецЦикла;
	 
	 Возврат МассивДоговоров;
	 
 КонецФункции
 
  Функция СоздатьРеализацииНаСервере(ПараметрыЗапуска, УникальныйИдентификатор) 
	 
	 НаименованиеЗадания = "Запуск длительной операции";
	 ВыполняемыйМетод = "ВКМ_ДлительныеОперации1.СозданиеРеализаций";
	 ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	 ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	 ПараметрыВыполнения.ЗапуститьВФоне = Истина; 
	 
	 МассивДанных = Новый Массив;
	 СтруктураРеквизитов = Новый Структура("Период", Объект.Период);
	 МассивДанных.Добавить(СтруктураРеквизитов);
	 ТЗ = Объект.ДоговорИРеализация.Выгрузить();
	 МассивСтруктур = ТаблицаЗначенийВМассив(ТЗ);
	 МассивДанных.Добавить(МассивСтруктур);

	 ПараметрыЗапуска.Вставить("ДанныеОбъекта", МассивДанных);
	 
	 СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
	 ВыполняемыйМетод, ПараметрыЗапуска.ПараметрыВыполнения, ПараметрыЗапуска.ДанныеОъекта);
	 
	 Возврат СтруктураФоновогоЗадания;
	 
 КонецФункции
 
 &НаКлиенте
 Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
	 
	 ЗаполнитьРеализацииНаСервере();
	 а=1;
	 
 КонецПроцедуры
 
 Функция ТаблицаЗначенийВМассив(ТаблицаЗначений)
	 
	 Массив = Новый Массив();
	 СтруктураСтрокой ="";
	 НужнаЗапятая = Ложь;
	 Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		 Если НужнаЗапятая Тогда 
			 СтруктураСтрокой = СтруктураСтрокой + ",";
		 КонецЕсли;
		 СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		 НужнаЗапятая = Истина;
	 КонецЦикла;
	 Для Каждого Строка Из ТаблицаЗначений Цикл
		 НоваяСтрока = Новый Структура(СтруктураСтрокой);
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		 Массив.Добавить(НоваяСтрока);
	 КонецЦикла;
	 Возврат Массив;
	 
 КонецФункции 
 
 &НаСервере
 Процедура ЗаполнитьРеализацииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Объект.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Договор");
	ТЗ.Колонки.Добавить("Документ");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.Реализация;
	КонецЦикла;
	
	Для Каждого Строка Из Объект.ДоговорИРеализация Цикл
		СтрокаТЗ = ТЗ.Найти(Строка.Договор);
		Строка.Документ = СтрокаТЗ.Документ;
	КонецЦикла;
	 
КонецПроцедуры
